#define _CRT_SECURE_NO_WARNINGS
#include "../Headers/LinkStack.h"
#include <stdio.h>

void ScanOrd(int *num) /*接收指令函数*/
{
    if ((scanf("%d", num)) != 1) /*使用if+scanf+do-while循环来确保输入合法*/
    {
        while (getchar() != '\n')
            ;
        *num = -1;
    }
}

void ScanInt(int *num) /*接收int数据类型函数*/
{
    int flag = 1; /*flag表示输入是否合法*/
    do
    {
        flag = 1;
        if ((scanf("%d", num)) != 1) /*使用if+scanf+do-while循环来确保输入合法*/
        {
            while (getchar() != '\n')
                ;
            flag = 0;
            fputs("输入不合法,请重新输入数据\n", stderr);
        }
    } while (flag != 1);
}

void MainMenu() /*主菜单函数*/
{
    printf("\n\n");
    printf("                           ******************************链栈ADT******************************\n");
    printf("                         ------------------------------------------------------------------------\n");
    printf("                              **************************************************************\n");
    printf("                              * 1.初始化链栈		**	2.销毁链栈		*\n");
    printf("                              **************************************************************\n");
    printf("                              * 3.检查链栈是否为空	**	4.查看栈头元素		*\n");
    printf("                              **************************************************************\n");
    printf("                              * 5.确定队列长度		**	6.入栈操作		*\n");
    printf("                              **************************************************************\n");
    printf("                              * 7.出栈操作		**	8.清空链栈		*\n");
    printf("                              **************************************************************\n");
    printf("                              *	        	      9.退出系统		        *\n");
    printf("                              **************************************************************\n");
    printf("                         ------------------------------------------------------------------------\n");
    printf("                              请选择菜单编号:");
}